#+TITLE: The Metacircular Evaluator
** Filter
#+name:filter
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (filter predicate sequence)
    (cond ((null? sequence) nil)
          ((predicate (car sequence)) (cons (car sequence) (filter predicate (cdr sequence))))
          (else (filter predicate (cdr sequence)))))
#+end_src

#+RESULTS:
: (1 3 5)

** eval 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-cNtlgO/org-babel-V9nLjZ.rkt:4:0: user-unitial-environment: unbound identifier
:   in: user-unitial-environment
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-cNtlgO/org-babel-V9nLjZ.rkt:4:0

** Test 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-AOYwAB/org-babel-GdDAoZ.rkt:4:0: right: unbound identifier
:   in: right
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-AOYwAB/org-babel-GdDAoZ.rkt:4:0

** cond arrow syntax 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (cond ((list 1 2 3 4) => cdr)
        (else cadr))
#+end_src

#+RESULTS:
: (2 3 4)

** Exercise 4.6 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (let->combination exp)
    (let ((varexps (cadr exp)))
      (let ((vars (map car varexps))
            (exps (map cadr varexps))
            (body (cddr exp)))
        (list (make-lambda vars body)
              exps))))
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-GCoIzS/org-babel-IaxuQQ.rkt:9:13: make-lambda: unbound identifier
:   in: make-lambda
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-GCoIzS/org-babel-IaxuQQ.rkt:9:13

** Exercise 4.8 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (named-let? exp) (symbol? (cadr exp)))
  (define (make-named-let var bindings body) (list 'let var bindings body))

  (define (body-let exp) (caddr exp))
  (define (bindings-let exp) (cadr exp))

  (define (var-named-let exp) (caddr exp))
  (define (body-named-let exp) (cadddr exp))
  (define (bindings-named-let exp) (caddr exp))

  (define (let->combination exp)
    (let ((exps (if (named-let? exp) (make-let (cons (var-named-let exp)
                                                     (bindings-named-let exp))
                                               (cons (var-named-let exp)
                                                     (bindings-named-let exp))) exp)))
      (let ((bindings (cadr exps)))
        (let ((vars (map car bindings))
              (exps (map cadr bindings))
              (body (cddr exps)))
          (list (make-lambda vars body)
                exps)))))
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-GCoIzS/org-babel-4nGRDZ.rkt:14:36: make-let: unbound identifier
:   in: make-let
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-GCoIzS/org-babel-4nGRDZ.rkt:14:36

** Exercise 4.12 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (scan vars vals f)
    (cond ((null? vars) 'not-found)
          ((eq? var (car vars)) (f vals))
          (else (scan (cdr vars) (cdr vals)))))

  (define (lookup-variable-value var env)
    (define (env-loop env)
      (if (eq? env the-empty-environment)
          (error "Unbound variable" var)
          (let ((frame (first-frame env)))
            (let ((result (scan (frame-varialbes frame)
                                (frame-values frame)
                                car)))
              (if (eq? result 'not-found)
                  (env-loop (enclosing-environment env))
                  result)))))
    (env-loop env))

  (define (set-variable-value! var val env)
    (define (env-loop env)
      (if (eq? env the-empty-environment)
          (error "Unbound variable: SET!" var)
          (let* ((frame (first-frame env))
                 (result (scan (frame-variables frame)
                               (frame-values frame)
                               (lambda (vals) (set-car! vals val)))))
            (if (eq? result 'not-found)
                (env-loop (enclosing-environment env))))))
    (env-loop env))

  (define (define-variable! var val env)
    (let* ((frame (first-frame env))
           (result (scan (frame-variables frame)
                         (frame-values frame)
                         (lambda (vals) (set-car! vals val)))))
      (if (eq? result 'not-found)
          (add-bindings-to-frame! var val frame))))
#+end_src

#+RESULTS:
: /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-cNtlgO/org-babel-WztdjV.rkt:6:14: var: unbound identifier
:   in: var
:   location...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-cNtlgO/org-babel-WztdjV.rkt:6:14

** last-pair 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (last-pair x)
    (if (null? (cdr x)) x  (last-pair (cdr x))))

  (define l1 (list 3 6 9 11))
  (last-pair l1)
  (set-cdr! (last-pair l1) (list 101 102))
  l1
#+end_src

#+RESULTS:
: (11)
: (3 6 9 11 101 102)

** Test 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (f x)
    (define (even? n) (if (= n 0) true (odd? (- n 1))))
    (define (odd? n) (if (= n 0) false (even? (- n 1))))
    (even? x))
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (a) (b))
  (define (b) 3)
  (a)
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (x)
    (define a b)
    (define b 3)
    a)
  (x)
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (x)
    (letrec ((a b)
             (b 3))
      a))
  (x)
#+end_src

#+RESULTS:
: b: undefined;
:  cannot use before initialization
:   context...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-uTMuc1/org-babel-thTasa.rkt:8:0
:    body of "/var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-uTMuc1/org-babel-thTasa.rkt"

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  ((lambda ()
    (let ((a '*unassigned*)
          (b '*unassigned*))
      (set! a b)
      (set! b 3)
      a)))
#+end_src

#+RESULTS:
: *unassigned*

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  ((lambda ()
    (let ((u '*unassigned*)
          (v '*unassigned*))
      (let ((a u) (b v)))
      (set! u v)
      (set! v 3)
      a)))
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (letrec ((a b)
           (b 3))
    a)
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (let ((fact (lambda (n) (if (= n 1) 1 (* n (fact (- n 1)))))))
    (fact 10))
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (letrec ((fact (lambda (n) (if (= n 1) 1 (* n (fact (- n 1)))))))
    (fact 10))
#+end_src

** Exercise 4.19 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (let ((a 1))
    (define (f x)
      (define b (+ a x))
      (define a 5)
      (+ a b))
    (f 10))
#+end_src

#+RESULTS:
: a: undefined;
:  cannot use before initialization
:   context...:
:    /var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-uTMuc1/org-babel-Zjfo2g.rkt:4:0
:    body of "/var/folders/_3/nwly65x92d13qp765t5gqbl40000gn/T/babel-uTMuc1/org-babel-Zjfo2g.rkt"

** Exercise 4.21 
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  ((lambda (n)
     ((lambda (fact) (fact fact n))
      (lambda (ft k) (if (= k 1) 1 (* k (ft ft (- k 1)))))))
   4)
#+end_src

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (fact n)
    (let ((f3 (lambda (ft k) (if (= k 1) 1 (* k (ft ft (- k 1)))))))
      (let ((f2 (lambda (fact) (fact fact n))))
        (let ((f1 (lambda (n) (f2 f3) n)))
          (f1 n)))))

  (fact 9)
#+end_src

#+RESULTS:
: 9

#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (f x)
    ((lambda (even? odd?) (even? even? odd? x))
     (lambda (ev? od? n)
       (if (= n 0) true (od? ev? od? (- n 1))))
     (lambda (ev? od? n)
       (if (= n 0) false (ev? ev? od? (- n 1))))))

  (f 101)
#+end_src

#+RESULTS:
: #f

